const { PrismaClient } = require('@prisma/client')
const fs = require('fs')
const csv = require('csv-parse')
const path = require('path')
const prisma = new PrismaClient()

async function main() {
  // Attendance Statuses
  await prisma.$executeRawUnsafe(`
    INSERT INTO attendancestatuses (id, name, createdAt, updatedAt, isDeleted, deletedAt, updatedBy) VALUES
(1, 'present', '2025-08-04 19:40:49', '2025-08-04 19:40:49', 0, NULL, NULL),
(2, 'absent', '2025-08-04 19:40:49', '2025-08-04 19:40:49', 0, NULL, NULL),
(3, 'late', '2025-08-04 19:40:49', '2025-08-04 19:40:49', 0, NULL, NULL),
(4, 'sick leave', '2025-08-04 19:40:49', '2025-08-04 19:40:49', 0, NULL, NULL),
(5, 'personal leave', '2025-08-04 19:40:49', '2025-08-04 19:40:49', 0, NULL, NULL);

  `);

  // Blogs
  //   await prisma.$executeRawUnsafe(`
  //     INSERT INTO blogs (id, title, description, coverImg, content, category, author, createdAt, updatedAt, isDeleted, deletedAt, updatedBy) VALUES
  // (13, 'เรียนเชิญร่วมสมทบทุนผ้าป่าเพื่อการศึกษา สมทบทุนจัดซื้อรถยนต์ รับ-ส่งนักเรียน ปี 2568', 'โรงเรียนท่าบ่อพิทยาคม ขอเชิญทุกท่านร่วมสมทบทุนผ้าป่าเพื่อการศึกษา เพื่อสมทบทุนจัดซื้อรถยนต์ รับ-ส่งนักเรียน ปี 2568', 'https://unsplash.com/photos/a-wooden-table.png', '\"โรงเรียนท่าบ่อพิทยาคม ขอเชิญทุกท่านร่วมสมทบทุนผ้าป่าเพื่อการศึกษา เพื่อสมทบทุนจัดซื้อรถยนต์ รับ-ส่งนักเรียน ปี 2568 ----\"', 'สมทบทุนการศึกษา', NULL, '2025-08-04 19:51:50', '2025-09-18 03:44:01', 0, NULL, 13),
  // (15, 'helloworld', 'helloworld', 'https://plus.unsplash.com/premium_photo-1754759085407-370a467be18c?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D', '\"helloworld helloworld\\n\"', 'helloworld', 13, '2025-09-18 00:58:33', '2025-09-18 03:44:24', 0, NULL, 13),
  // (16, 'test', 'testtest', 'https://images.unsplash.com/photo-1756460886124-fca30da074c4?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D', '{\"time\":1758191467439,\"blocks\":[],\"version\":\"2.31.0-rc.7\"}', 'test', 13, '2025-09-18 03:16:16', '2025-09-18 03:31:07', 0, NULL, 13);

  //   `);

  // Comments
  //   await prisma.$executeRawUnsafe(`
  //     INSERT INTO comments (id, comment, userId, postId, createdAt, updatedAt, deletedAt) VALUES
  // (5, 'thtnhnt', 13, 15, '2025-09-18 01:45:40', '2025-09-18 01:45:40', NULL),
  // (6, 'ncdgug\n', 13, 15, '2025-09-18 03:14:48', '2025-09-18 03:14:48', NULL),
  // (7, 'hi', 13, 16, '2025-09-23 06:30:29', '2025-09-23 06:30:29', NULL);

  //   `);

  // Days of Week
  await prisma.$executeRawUnsafe(`
    INSERT INTO daysofweek (id, name, createdAt, updatedAt, deletedAt) VALUES
(1, 'Monday', '2025-08-04 19:41:08', '2025-08-04 19:41:08', NULL),
(2, 'Tuesday', '2025-08-04 19:41:08', '2025-08-04 19:41:08', NULL),
(3, 'Wednesday', '2025-08-04 19:41:08', '2025-08-04 19:41:08', NULL),
(4, 'Thursday', '2025-08-04 19:41:08', '2025-08-04 19:41:08', NULL),
(5, 'Friday', '2025-08-04 19:41:08', '2025-08-04 19:41:08', NULL);

  `);

  // Departments
  await prisma.$executeRawUnsafe(`
    INSERT INTO departments (id, name, headTeacherId, createdAt, updatedAt, deletedAt) VALUES
(1, 'ฝ่ายบริหาร', NULL, '2025-08-15 12:14:18', '2025-08-15 12:14:18', NULL),
(2, 'กลุ่มสาระการเรียนรู้ภาษาไทย', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(3, 'กลุ่มสาระการเรียนรู้คณิตศาสตร์', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(4, 'กลุ่มสาระการเรียนรู้วิทยาศาสตร์และเทคโนโลยี', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(5, 'กลุ่มสาระการเรียนรู้สังคมศึกษาฯ', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(6, 'กลุ่มสาระการเรียนรู้สุขศึกษาฯ', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(7, 'กลุ่มสาระการเรียนรู้ศิลปะ', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(8, 'กลุ่มสาระการเรียนรู้ภาษาต่างประเทศ', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(9, 'ธุระการโรงเรียน', NULL, '2025-08-15 13:03:40', '2025-08-15 13:03:40', NULL),
(10, 'นักการภารโรง', NULL, '2025-08-27 18:46:00', '2025-08-27 18:46:00', NULL);

  `);

  // Genders
  await prisma.$executeRawUnsafe(`
    INSERT INTO genders (id, genderName, createdAt, updatedAt, deletedAt) VALUES
(1, 'male', '2025-08-04 19:41:25', '2025-08-04 19:41:25', NULL),
(2, 'female', '2025-08-04 19:41:25', '2025-08-04 19:41:25', NULL),
(3, 'other', '2025-08-04 19:41:25', '2025-08-04 19:41:25', NULL);

  `);

  // School Info
  await prisma.$executeRawUnsafe(`
    INSERT INTO school_info (id, name, location, foundedDate, currentDirector, education_level, department, description, heroImage, director_image, director_quote, createdAt, updatedAt, createdBy, updatedBy) VALUES
(1, 'โรงเรียนท่าบ่อพิทยาคม', 'บ้านป่าสัก ตำบลกองนาง อำเภอท่าบ่อ จังหวัดหนองคาย', '14 พฤษภาคม 2534', 'นายชำนาญวิทย์ ประเสริฐ', 'มัธยมศึกษาปีที่ 1-3', 'สำนักงานเขตพื้นที่การศึกษามัธยมศึกษา เขต 21', 'โรงเรียนท่าบ่อพิทยาคม เป็นโรงเรียนมัธยมศึกษาประจำตำบลกองนาง สังกัดสำนักงานเขตพื้นที่การศึกษามัธยมศึกษา เขต 21 เปิดทำการเรียนการสอนครั้งแรกเป็นโรงเรียนสาขาของโรงเรียนท่าบ่อ เริ่มเปิดเรียนเมื่อวันที่ 14 พฤษภาคม 2534  โดยมีนายประพันธ์  พรหมกูล  เป็นผู้ดูแล  โดยขอใช้อาคารเรียนของโรงเรียนบ้านหงส์ทองสามขา เป็นสถานที่เรียนชั่วคราว และมีนักเรียน ทั้งหมด 86 คน จำนวน  2  ห้องเรียน\nต่อมาได้ย้ายมาอยู่  ณ บริเวณที่สาธารณประโยชน์ หมู่ 9 บ้านป่าสัก ตำบลกองนาง อำเภอท่าบ่อ จังหวัดหนองคาย และที่ดินบริจาค จากคุณยายแก่นคำ  มั่งมูล, คุณแม่สุบิน น้อยโสภา  และคุณพ่อสุพล  น้อยโสภา  จำนวน 4.5  ไร่ รวมจำนวนที่ดินทั้งสิ้นประมาณ 65 ไร่ โดยได้รับงบประมาณในการสร้างอาคารจากกรมสามัญศึกษา  กระทรวงศึกษาธิการ  \nเมื่อวันที่ 26 กุมภาพันธ์ 2535 ได้รับประกาศจัดตั้งเป็นเอกเทศ  โดยใช้ชื่อว่า “โรงเรียนท่าบ่อพิทยาคม” กรมสามัญศึกษาได้แต่งตั้งให้ นายศิริ  เพชรคีรี ผู้ช่วยผู้อำนวยการโรงเรียนท่าบ่อ  อ.ท่าบ่อ  จ.หนองคาย มารักษาการในตำแหน่งครูใหญ่ ในปีงบประมาณ 2545  ได้รับจัดสรรงบประมาณจากกรมสามัญศึกษา ให้จัดสร้างอาคารเรียนแบบกึ่งถาวร  1  หลัง และโรงอาหารมาตรฐาน 300 ที่นั่ง  1  หลัง ในวันที่ 7 กรกฎาคม 2546 โรงเรียนท่าบ่อพิทยาคมเปลี่ยนมาสังกัดสำนักงานเขตพื้นที่การศึกษาหนองคาย เขต 1  สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน กระทรวงศึกษาธิการ ตามพระราชบัญญัติระเบียบบริหารราชการกระทรวงศึกษาธิการ พ.ศ.2546 และในวันที่ 23  กรกฎาคม  2553  \nโรงเรียนท่าบ่อพิทยาคม  เปลี่ยนมาสังกัด สำนักงานเขตพื้นที่การศึกษามัธยมศึกษา เขต 21  ตาม พ.ร.บ.การศึกษาแห่งชาติ (ฉบับที่ 3) พ.ร.บ.ระเบียบบริหารราชการกระทรวงศึกษาธิการ (ฉบับที่ 3) และ พ.ร.บ.ระเบียบข้าราชการครูและบุคลากรทางการศึกษา (ฉบับที่ 3) ซึ่งได้มีการประกาศในราชกิจจานุเบกษา เมื่อวันที่  22 กรกฎาคม 2553 และมีผลบังคับใช้ ตั้งแต่วันที่ 23 กรกฎาคม 2553  ปัจจุบันมี นายชำนาญวิทย์ ประเสริฐ เป็นผู้อำนวยการโรงเรียน', 'frontend\\src\\assets\\images\\10.jpg', 'http://www.thabopit.com/_files_school/43100510/person/43100510_0_20241104-160235.jpg', 'โรงเรียนท่าบ่อพิทยาคมมุ่งมั่นพัฒนาผู้เรียนให้มีความรู้คู่คุณธรรม มีทักษะที่จำเป็นในศตวรรษที่ 21 และเป็นพลเมืองที่ดีของสังคม', '2025-08-07 09:05:18', '2025-09-18 02:10:28', 0, 13);

  `);

  // School Timeline
  await prisma.$executeRawUnsafe(`
    INSERT INTO school_timeline (id, year, date, title, description, sortOrder, createdAt, updatedAt, createdBy, updatedBy, deletedBy, deletedAt) VALUES
(1, '2534', '1991-05-14', 'เปิดทำการเรียนการสอนเป็นครั้งแรก', 'เปิดทำการเรียนการสอนครั้งแรกเป็นโรงเรียนสาขาของโรงเรียนท่าบ่อ โดยมีนายประพันธ์ พรหมกูล เป็นผู้ดูแล ใช้อาคารเรียนของโรงเรียนบ้านหงส์ทองสามขาเป็นสถานที่เรียนชั่วคราว มีนักเรียนทั้งหมด 86 คน แบ่งเป็น 2 ห้องเรียน', 1, '2025-08-07 09:05:18', '2025-09-18 03:07:57', 0, 13, 0, 0),
(2, '2535', '2025-09-17', 'จัดตั้งเป็นเอกเทศ', 'โรงเรียนได้รับประกาศจัดตั้งเป็นเอกเทศ โดยใช้ชื่อว่า โรงเรียนท่าบ่อพิทยาคม และกรมสามัญศึกษาได้แต่งตั้งให้นายศิริ เพชรคีรี ผู้ช่วยผู้อำนวยการโรงเรียนท่าบ่อ มารักษาการในตำแหน่งครูใหญ่', 2, '2025-08-07 09:05:18', '2025-09-18 03:05:11', 0, 13, 0, 0),
(3, '2545', 'ปีงบประมาณ 2545', 'ก่อสร้างอาคารเรียน', 'โรงเรียนได้รับจัดสรรงบประมาณจากกรมสามัญศึกษาเพื่อสร้างอาคารเรียนแบบกึ่งถาวร 1 หลัง และโรงอาหารมาตรฐาน 300 ที่นั่ง 1 หลัง', 3, '2025-08-07 09:05:18', '2025-08-07 09:05:18', 0, 0, 0, 0),
(4, '2546', '7 กรกฎาคม 2546', 'เปลี่ยนสังกัด', 'โรงเรียนท่าบ่อพิทยาคมเปลี่ยนมาสังกัดสำนักงานเขตพื้นที่การศึกษาหนองคาย เขต 1 ตามพระราชบัญญัติระเบียบบริหารราชการกระทรวงศึกษาธิการ พ.ศ. 2546', 4, '2025-08-07 09:05:18', '2025-08-27 10:49:56', 0, 13, 0, 0),
(5, '2553', '23 กรกฎาคม 2553', 'สังกัดเขตพื้นที่การศึกษามัธยมศึกษา', 'โรงเรียนท่าบ่อพิทยาคมเปลี่ยนมาสังกัดสำนักงานเขตพื้นที่การศึกษามัธยมศึกษา เขต 21 ตามพระราชบัญญัติการศึกษาแห่งชาติ (ฉบับที่ 3) และพระราชบัญญัติระเบียบบริหารราชการกระทรวงศึกษาธิการ (ฉบับที่ 3)', 5, '2025-08-07 09:05:18', '2025-08-07 09:05:18', 0, 0, 0, 0),
(6, 'ปัจจุบัน', 'ปัจจุบัน', 'การพัฒนาอย่างต่อเนื่อง', 'ปัจจุบัน โรงเรียนท่าบ่อพิทยาคมมีนายชำนาญวิทย์ ประเสริฐ ดำรงตำแหน่งผู้อำนวยการโรงเรียน และมีการพัฒนาอย่างต่อเนื่องเพื่อมุ่งสู่ความเป็นเลิศทางวิชาการ', 6, '2025-08-07 09:05:18', '2025-08-07 09:05:18', 0, 0, 0, 0),
(9, '2024', '14 semtember 2024', 'helloworld', 'abce', 0, '2025-08-07 11:46:16', '2025-08-07 12:00:22', 12, 12, 12, 2147483647),
(10, '2035', '14  MAY 2035', 'MARS', 'OEUAO', 0, '2025-08-07 12:07:07', '2025-08-07 12:07:25', 12, 0, 12, 2147483647),
(11, '2035', '14 semtember 2024', 'mar', 'oa', 0, '2025-08-07 12:09:53', '2025-08-07 12:10:59', 12, 0, 12, 2147483647),
(12, '2564', '12 มีนาคม', 'ข่าวสาร', 'เทส', 0, '2025-08-08 01:45:16', '2025-08-08 01:46:58', 12, 0, 12, 2147483647),
(13, '2568', '12 มกราคม 2568', 'hello', 'hngs', 0, '2025-09-18 02:05:40', '2025-09-18 02:08:00', 13, 13, 13, 1),
(14, '2568', '12 มกราคม 2568', 'helloworld', 'oauntoh', 0, '2025-09-18 02:08:43', '2025-09-18 02:08:54', 13, 13, 13, 1),
(15, '2658', '14 semtember 2024', 'hello', 'hellobnt', 0, '2025-09-18 02:09:17', '2025-09-18 02:33:19', 13, 13, 13, 1),
(16, '', '', 'hello', 'hello', 0, '2025-09-18 02:32:51', '2025-09-18 02:33:16', 13, 13, 13, 1),
(17, '2020', '2025-09-18', 'hello', 'hello', 0, '2025-09-18 02:59:23', '2025-09-18 02:59:23', 13, 13, 0, 0);

  `);

  // Super Admin
  //   await prisma.$executeRawUnsafe(`
  //     INSERT INTO superadmin (id, userId, namePrefix, fullName, genderId, phoneNumber, createdAt, updatedAt, isDeleted, deletedAt) VALUES
  // (1, 1, 'นางสาว', 'อารยา หงษาวงษ์', 2, '0123456789', '2025-08-04 19:47:41', '2025-08-04 19:47:41', 0, NULL);

  //   `);

  // Teachers
  await prisma.$executeRawUnsafe(`
        INSERT INTO teachers (departmentId, namePrefix, fullName, genderId, dob, nationality, position, level, phoneNumber, createdAt, updatedAt, isDeleted, deletedAt, updatedBy, imagePath, email, address, education, major, biography, specializations) VALUES
    (1, 'นาย', 'ชำนาญวิทย์ ประเสริฐ', 1, NULL, 'ไทย', 'ผู้อำนวยการ', 'คศ. 3', '0642466644', '2025-08-27 18:29:44', '2025-08-27 18:29:44', 0, NULL, NULL, '/src/assets/images/teachers/admin1.jpg', 'Chumnanwit1@gmail.com', '', 'ปริญญาโท', '', '', ''),
    (1, 'นาง', 'พิชญา สุวงศ์', 2, '1972-01-13', 'ไทย', 'รองผู้อำนวยการ', 'คศ. 3', '0872153025', '2025-08-27 18:39:13', '2025-08-27 18:39:13', 0, NULL, NULL, '/src/assets/images/teachers/admin2.jpg', 'pitchaya2@gmail.com', '277 ต.พานพร้าว อ.ศรีเชียงใหม่ จ.หนองคาย', 'ปริญญาโท', 'คณะมนุษยศาสตร์ เอกภาษาไทย มหาวิทยาลัยพิษณุโลก', '', ''),
    (2, 'นาง', 'อามร คำเสมอ', 2, '1976-04-19', 'ไทย', 'หัวหน้ากลุ่มสาระ', 'คศ. 3', '0882653492', '2025-08-27 18:48:51', '2025-08-27 18:48:51', 0, NULL, NULL, '/src/assets/images/teachers/thai1.jpg', 'amon3@gmail.com', '', 'ปริญญาโท', 'คณะมนุษยศาสตร์ เอกภาษาไทย', '', ''),
    (2, 'นาง', 'พรศิริ พิมพ์พา', 2, '1985-06-14', 'ไทย', 'ครูชำนาญการพิเศษ', 'คศ. 3', '0645385853', '2025-08-27 19:00:00', '2025-08-27 19:00:00', 0, NULL, NULL, '/src/assets/images/teachers/thai2.jpg', 'pornsiri4@gmail.com', '', 'ปริญญาตรี', 'คณะมนุษยศาสตร์ เอกภาษาไทย', '', ''),
    (3, 'นาง', 'เกษร ผาสุข', 2, '1987-07-24', 'ไทย', 'หัวหน้ากลุ่มสาระ', 'คศ. 3', '0665432587', '2025-08-27 19:02:31', '2025-08-27 19:02:31', 0, NULL, NULL, '/src/assets/images/teachers/math1.jpg', 'kesorn5@gmail.com', '', 'ปริญญาโท', 'เอกวิทยาศาสตร์', '', ''),
    (3, 'นาย', 'ณัฐวุฒิ เจริญกุล', 1, '1978-10-22', 'ไทย', 'ครู', 'คศ. 3', '0982653456', '2025-08-27 19:06:12', '2025-08-27 19:06:12', 0, NULL, NULL, '/src/assets/images/teachers/math2.jpg', 'Nutthawut6@gmail.com', '', 'ปริญญาตรี', '', '', ''),
    (4, 'นางสาว', 'วิไลลักษณ์ อ่างแก้ว', 2, '1987-02-27', 'ไทย', 'หัวหน้ากลุ่มสาระ', 'คศ. 3', '0923685489', '2025-08-27 19:09:17', '2025-08-27 19:09:17', 0, NULL, NULL, '/src/assets/images/teachers/science1.jpg', 'wilailak7@gmail.com', 'ต.กองนาง อ.ท่าบ่อ จ.หนองคาย', 'ปริญญาตรี', '', '', ''),
    (4, 'นางสาว', 'สุรางคณา เหลืองกิจไพบูลย์', 2, NULL, 'ไทย', 'ครู', 'คศ. 1', '0654657895', '2025-08-27 19:11:32', '2025-08-27 19:11:32', 0, NULL, NULL, '/src/assets/images/teachers/science2.jpg', 'surangkana8@gmail.com', '', 'ปริญญาโท', 'คณะวิทยาศาสตร์ สาขาเทคโนโลยีสารสนเทศ มหาวิทยาลัยขอนแก่น', '', ''),
    (4, 'นางสาว', 'ศรัณยา ดลรัศมี', 2, NULL, 'ไทย', 'ครูผู้ช่วย', NULL, '0889684532', '2025-08-27 19:14:28', '2025-08-27 19:14:28', 0, NULL, NULL, '/src/assets/images/teachers/science3.jpg', 'sarunya9@gmail.com', '', 'ปริญญาตรี', '', '', ''),
    (4, 'นางสาว', 'จีรนันท์ พรหมพิภักดิ์', 2, NULL, 'ไทย', 'พนักงานราชการ', NULL, '0975264855', '2025-08-27 19:18:10', '2025-08-27 19:18:10', 0, NULL, NULL, '/src/assets/images/teachers/science4.jpg', 'jeeranan10@gmail.com', '', 'ปริญญาตรี', '', '', ''),
    (5, 'นางสาว', 'ศิริกัญญา กาอุปมุง', 2, NULL, 'ไทย', 'หัวหน้ากลุ่มสาระ', 'ครูผู้ช่วย', '0932458765', '2025-08-27 19:27:40', '2025-08-27 19:27:40', 0, NULL, NULL, '/src/assets/images/teachers/social1.jpg', 'silikanya11@gmail.com', '', 'ปริญญาตรี', '', '', ''),
    (5, 'นางสาว', 'กมลชนก รีวงษา', 2, NULL, 'ไทย', 'ครูอัตราจ้าง', '', '0654678475', '2025-08-27 19:32:37', '2025-08-27 19:32:37', 0, NULL, NULL, '/src/assets/images/teachers/social2.jpg', 'kamonchanok12@gmail.com', 'ต.กองนาง อ.ท่าบ่อ จ.หนองคาย', 'ปริญญาตรี', 'คณะมนุษยศาตร์ สาขาวิชาสังคมศาสตร์', '', ''),
    (6, 'นาย', 'ทวีศักดิ์ มณีรัตน์\r\n', 1, '1984-05-23', 'ไทย', 'หัวหน้ากลุ่มสาระ', 'คศ. 3', '0852468592', '2025-08-27 19:39:05', '2025-08-27 19:39:05', 0, NULL, NULL, '/src/assets/images/teachers/health1.jpg', 'taweesak18@gmail.com', '', 'ปริญญาตรี', '', '', ''),
    (7, 'นาย', 'ศุภชัย โคตรชมภู', 1, '1988-04-23', 'ไทย', 'หัวหน้ากลุ่มสาระ', 'คศ. 3', '0875364854', '2025-08-27 19:41:59', '2025-08-27 19:41:59', 0, NULL, NULL, '/src/assets/images/teachers/art1.jpg', 'suphachai13@gmail.com', '', 'ปริญญาตรี', '', '', ''),
    (8, 'นาง', 'อุบล แสงโสดา', 2, '1979-08-25', 'ไทย', 'ครู', 'คศ. 3', '0653425859', '2025-08-27 19:44:40', '2025-08-27 19:44:40', 0, NULL, NULL, '/src/assets/images/teachers/foreign1.jpg', 'ubon14@gmail.com', '', 'ปริญญาตรี', 'คณะมนุษศาสตร์ สาขาวิชาภาษาอังกฤษ', '', ''),
    (8, 'นาง', 'วราภรณ์ แสงแก้ว', 2, NULL, 'ไทย', 'พนักงานราชการ', 'คศ. 3', '0854325869', '2025-08-27 19:47:01', '2025-08-27 19:47:01', 0, NULL, NULL, '/src/assets/images/teachers/foreign2.jpg', 'waraporn15@gmail.com', '', 'ปริญญาตรี', 'คณะมนุษยศาสตร์ เอกวิชาภาษาอังกฤษ', '', ''),
    (9, 'นาย', 'ธีรพงษ์ หมอยาเก่า', 1, NULL, 'ไทย', 'พนักงานราชการ', NULL, '0963568745', '2025-08-27 19:50:12', '2025-08-27 19:50:12', 0, NULL, NULL, '/src/assets/images/teachers/support1.jpg', 'theeraphong16@gmail.com', '', 'ปริญญาตรี', '', '', ''),
    (10, 'นาย', 'ลาญู น้อยโสภา', 1, NULL, 'ไทย', 'พนักงานราชการ', NULL, NULL, '2025-08-27 19:50:12', '2025-08-27 19:50:12', 0, NULL, NULL, '/src/assets/images/teachers/support2.jpg', 'larn17@gmail.com', '', '', '', '', '');

      `);

  // User Roles
  await prisma.$executeRawUnsafe(`
    INSERT INTO userroles (id, roleName, createdAt, updatedAt, deletedAt) VALUES
(1, 'super_admin', '2025-08-04 19:41:46', '2025-08-04 19:41:46', NULL),
(2, 'admin', '2025-08-04 19:41:46', '2025-08-04 19:41:46', NULL),
(3, 'teacher', '2025-08-04 19:41:46', '2025-08-04 19:41:46', NULL),
(4, 'student', '2025-08-04 19:41:46', '2025-08-04 19:41:46', NULL),
(5, 'user', '2025-08-04 19:41:46', '2025-08-04 19:41:46', NULL);

  `);

  const csvFilePath = path.join(__dirname, 'student_list_2.csv')
  const fileContent = fs.readFileSync(csvFilePath, 'utf-8')

  // Parse CSV file
  const records = await new Promise((resolve, reject) => {
    csv.parse(fileContent, {
      columns: true,
      skip_empty_lines: true,
      trim: true, 
      bom: true   
    }, (err, records) => {
      if (err) reject(err)
      resolve(records)
    })
  })

  // console.log(`Found ${records.length} students in CSV file`)

  // Insert students one by one
  for (const record of records) {
    try {
      const student = await prisma.students.create({
        data: {
          namePrefix: record.namePrefix,
          fullName: record.fullName,
          classRoom: record.classroom,
          genderId: parseInt(record.genderId),
          studentNumber: parseInt(record.studentId),
          createdAt: new Date(),
          updatedAt: new Date()
        }
      })
      // console.log(`Created student: ${student.fullName}`)
    } catch (error) {
      console.error(`Error creating student ${record.fullName}:`, error)
    }
  }
}

// Run the seed function
main()
  .catch(e => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })